import pandas as pd

# Словник з лабораторної роботи №6 (доповнений даними)
data = {
    'Категорія': ['М\'ясні продукти', 'Фрукти', 'Овочі', 'М\'ясні продукти', 'Молочні продукти', 'Овочі', 'Овочі'],
    'Продукт': ['Яловичина', 'Апельсини', 'Буряк', 'Свинина', 'Молоко', 'Часник', 'Капуста'],
    'Кількість': [1, 2, 3, 4, 5, 6, 7], #<---Дані з лабораторної роботи №6
    'Ціна': [7, 3, 1.6, 2, 4, 3.4, 3]
}

# Створення датафрейму
df = pd.DataFrame(data)

# Виведення датафрейму на екран
print("Датафрейм:")
print(df)

# Агрегація та групування
grouped = df.groupby('Категорія').agg({
    'Кількість': 'sum',
    'Ціна': 'mean'
})

print("\nАгрегація та групування:")
print(grouped)
